# ConduitSizes Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSizes Class
Members See Also
---
Class ConduitSizeSet being used to store the conduit sizes.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class ConduitSizes : IEnumerable<ConduitSize>,
	IDisposable
```

Visual Basic
---
```text
Public Class ConduitSizes _
	Implements IEnumerable(Of ConduitSize), IDisposable
```

Visual C++
---
```text
public ref class ConduitSizes : IEnumerable<ConduitSize^>,
	IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Electrical..::..ConduitSizes
# See Also
ConduitSizes Members
Autodesk.Revit.DB.Electrical Namespace